In [8]:
"""took an online course 'Foundation of Pandas Data Analysis' in www.inflearn.com """
import pandas as pd

In [9]:
# pandas is much faster than excel
# pandas uses numpy to compute numbers -> fast performance
data_frame = pd.read_csv('friend_list.csv')

In [10]:
data_frame

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [11]:
data_frame.head(2)

    name  age        job
0   John   20    student
1  Jenny   30  developer

In [12]:
data_frame.tail()

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [13]:
# series = column
# dataframe is combination of the serieses 

type(data_frame.name) # type is series

pandas.core.series.Series

In [14]:
#how do we make series?
#by Python's list
list_tmp = [1,2,3]

In [15]:
list_tmp

[1, 2, 3]

In [16]:
#let's make series

#first column(=series)
s1 = pd.core.series.Series([1,2,3])

#second column(=series)
s2 = pd.core.series.Series(['one','two','three'])

In [17]:
# make dataframe by series
# combine series with header via dictionary
pd.DataFrame(data=dict(num=s1,word=s2))

   num   word
0    1    one
1    2    two
2    3  three

In [18]:
"""Lecture2 : Getting data from file"""

# check the version of pandas
#(you can substitute pip with conda if you are using Anaconda)

!pip list | grep pandas

pandas                                 0.23.1

In [19]:
# csv file : df = pd.read_csv("file_route")

# csv = txt
df = pd.read_csv('friend_list.txt')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [20]:
# csv != tab file
df = pd.read_csv('friend_list_tab.txt')
df

         name\tage\tjob
0     John\t20\tstudent
1  Jenny\t30\tdeveloper
2     Nate\t30\tteacher
3    Julia\t40\tdentist
4    Brian\t45\tmanager
5     Chris\t25\tintern

In [21]:
# designate delimiter as '\t'
df = pd.read_csv('friend_list_tab.txt', delimiter = '\t')
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [22]:
 # if there is no header in data 
df = pd.read_csv('friend_list_no_head.csv')
df

    John  20    student
0  Jenny  30  developer
1   Nate  30    teacher
2  Julia  40    dentist
3  Brian  45    manager
4  Chris  25     intern

In [23]:
# inform that there is no header
df = pd.read_csv('friend_list_no_head.csv',header=None)
df

       0   1          2
0   John  20    student
1  Jenny  30  developer
2   Nate  30    teacher
3  Julia  40    dentist
4  Brian  45    manager
5  Chris  25     intern

In [24]:
# then, add a header
df.columns = ['name','age','job']
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [25]:
# load and assign header at the same time
df = pd.read_csv('friend_list_no_head.csv', header=None, names = ['name','age','job'])
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher
3  Julia   40    dentist
4  Brian   45    manager
5  Chris   25     intern

In [26]:
""" Create DataFrame from your python code """

# Created List containing dictionary
friend_dict_list = [
    {'name':'John','age':25,'job':'student'},
    {'name':'Nate','age':30,'job':'teacher'}
]

# create DataFrame by List that I created
df = pd.DataFrame(friend_dict_list)
df

   age      job  name
0   25  student  John
1   30  teacher  Nate

In [27]:
# dictionary has no order(key order is not guaranteed) -> DataFrame header may not be in order
# so re-order the DataFrame
df = df[['name','age','job']]
df

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [28]:
# Or, there is another way to order the dictionary
# Use OrderedDict package

from collections import OrderedDict
# this guarantees key's order
friend_ordered_dict = OrderedDict(
    [
        ('name',['John','Nate']),
        ('age',[25,30]),
        ('job',['student','teacher'])
    ]
)

In [29]:
df = pd.DataFrame.from_dict(friend_ordered_dict)
df.head()

   name  age      job
0  John   25  student
1  Nate   30  teacher

In [30]:
friend_list = [
    ['John', 20,'student'],
    ['Nate',30, 'teacher'],
]

In [31]:
column_name = ['name', 'age', 'job']

In [32]:
df = pd.DataFrame.from_records(friend_list, columns = column_name)

In [33]:
df.head()

   name  age      job
0  John   20  student
1  Nate   30  teacher

In [34]:
friend_list = [
    ['name',['Jone','Nate']],
    ['age',[20,30]],
    ['job',['student','teacher']]
]

In [38]:
df = pd.DataFrame.from_items(friend_list)

/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

In [36]:
df.head()

   name  age      job
0  Jone   20  student
1  Nate   30  teacher

In [37]:
"""Write DataFrame To File"""
df.to_csv('friends.csv')

In [39]:
# 데이터만 csv에 넣고 싶다.
# na_rep = '-' 널값에는 대쉬를 대신 넣어라!
df.to_csv('friends.csv', index = False, header = False, na_rep = '-')

In [40]:
""" Dataframe row, column selection """

friend_list = [
    ['name',['John','Jenny','Nate']],
    ['age',[20,30,30]],
    ['job',['student','developer','teacher']]
]
df = pd.DataFrame.from_items(friend_list)

/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/ipykernel_launcher.py:8: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.

In [41]:
df

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

In [42]:
# 1번, 2번인덱스만 갖고온다.
df[1:3]

    name  age        job
1  Jenny   30  developer
2   Nate   30    teacher

In [45]:
df = pd.DataFrame.from_items(friend_list)
df

/Library/Frameworks/Python.framework/Versions/3.6/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: from_items is deprecated. Please use DataFrame.from_dict(dict(items), ...) instead. DataFrame.from_dict(OrderedDict(items)) may be used to preserve the key order.
  """Entry point for launching an IPython kernel.

    name  age        job
0   John   20    student
1  Jenny   30  developer
2   Nate   30    teacher

### by column condition

In [46]:
# 나이는 스물세살 데이터만 원해